src/cf/InformationRegisters/ор_РеестрЦенПроизводителейНаЖНВЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ор_РеестрЦенПроизводителейНаЖНВЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_Производители</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаВыпускаПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВУпаковке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОптоваяНаценка</Name>
					<Comment>Оптовая наценка (не используется)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РозничнаяНаценка</Name>
					<Comment>Розничная наценка (не используется)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВыписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Это1СНоменклатура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаВыпускаКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдРЛС</Name>
					<Comment>ID РЛС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистрацииЦены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ор_РеестрЦенПроизводителейНаЖНВЛП/Forms/ФормаЗагрузкиЦенС1СНоменклатура/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("РежимЗагрузкиС1СНоменклатура") Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru = 'Самостоятельное использование формы не предусмотрено'");
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыборИсточникаЗагрузки;
	ДействиеЗагрузки = "ПОЛНАЯ";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СнятьВсе(Команда)
	УстановитьФлагТаблицы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсе(Команда)
	УстановитьФлагТаблицы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьРеестрЦен(Команда)
	
	Результат = СохранитьРеестрЦенНаСервере();
	
	Если Результат Тогда
		
		Модифицированность = Ложь;
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ор_РеестрЦенПроизводителейНаЖНВЛП"));
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗавершениеМастера;
		УправлениеИнтерфейсом();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	ОписаниеОшибки = "";
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыборИсточникаЗагрузки Тогда
		
		Если ДействиеЗагрузки = "" Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать действие загрузки.'"));
			Возврат;
		КонецЕсли;
		
		НачатьЗагрузкуИзСервиса();
		
	Иначе
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗавершениеМастера;
		УправлениеИнтерфейсом();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьФлагТаблицы(ЗначениеФлага)
	
	Для Каждого Элемент Из ТаблицаДанных Цикл
		Элемент.Использование = ЗначениеФлага;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СохранитьРеестрЦенНаСервере()
	
	НайденныеСтроки = ТаблицаДанных.НайтиСтроки(Новый Структура("Использование", Истина));
	Если НайденныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не выбрано ни одной строки для сохранения'"));
		Возврат Ложь;
	КонецЕсли;
	
	ТекстОшибок = "";
	
	Если ДействиеЗагрузки = "ПОЛНАЯ" Тогда
		// Удалим предыдущие записи.
		Набор = РегистрыСведений.ор_РеестрЦенПроизводителейНаЖНВЛП.СоздатьНаборЗаписей();
		Набор.Записать();
	ИначеЕсли ДействиеЗагрузки = "ОБНОВЛЕНИЕ" Тогда
		ОчиститьРеестрЦенПередОбновлениемНаСервере();
	КонецЕсли;
	
	// Запишем все выбранные строки.
	Для Каждого Строка Из ТаблицаДанных Цикл
		
		Если НЕ Строка.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = РегистрыСведений.ор_РеестрЦенПроизводителейНаЖНВЛП.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Строка);
		НоваяЗапись.Действует = Истина;
		НоваяЗапись.Это1СНоменклатура = Истина;
		
		Попытка
			НоваяЗапись.Записать();
		Исключение
			ТекстОшибок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1%2Не удалось записать строку: %3 - %4 в реестр цен производителей.'"),
				ТекстОшибок,
				?(ПустаяСтрока(ТекстОшибок), "", Символы.ПС),
				НоваяЗапись.Номенклатура,
				НоваяЗапись.Производитель);
		КонецПопытки;
		
	КонецЦикла;
	
	Если ТекстОшибок = "" Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
		ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Выполнено с ошибками:
			|%1'"),
			ТекстОшибок));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОчиститьРеестрЦенПередОбновлениемНаСервере()
	
	ВремТаблицаДанных = ТаблицаДанных.Выгрузить();
	
	Если ВремТаблицаДанных.Найти(Истина, "Использование") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнешнийИсточник.Номенклатура КАК Номенклатура,
	|	ВнешнийИсточник.ДатаРегистрацииЦены КАК ДатаРегистрацииЦены
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&ВнешнийИсточник КАК ВнешнийИсточник
	|ГДЕ
	|	ВнешнийИсточник.Использование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеестрЦенНаЖНВЛП.ШтрихКод КАК ШтрихКод,
	|	РеестрЦенНаЖНВЛП.Наименование КАК Наименование,
	|	РеестрЦенНаЖНВЛП.НаименованиеПроизводителя КАК НаименованиеПроизводителя,
	|	РеестрЦенНаЖНВЛП.ФормаВыпускаКраткое КАК ФормаВыпускаКраткое,
	|	РеестрЦенНаЖНВЛП.ИдРЛС КАК ИдРЛС,
	|	РеестрЦенНаЖНВЛП.ДатаРегистрацииЦены КАК ДатаРегистрацииЦены
	|ИЗ
	|	Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ор_РеестрЦенПроизводителейНаЖНВЛП КАК РеестрЦенНаЖНВЛП
	|		ПО Товары.Номенклатура = РеестрЦенНаЖНВЛП.Номенклатура
	|			И Товары.ДатаРегистрацииЦены = РеестрЦенНаЖНВЛП.ДатаРегистрацииЦены";
	
	Запрос.УстановитьПараметр("ВнешнийИсточник", ВремТаблицаДанных);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.ор_РеестрЦенПроизводителейНаЖНВЛП.СоздатьНаборЗаписей();
		Набор.Отбор.ШтрихКод.Установить(Выборка.ШтрихКод);
		Набор.Отбор.Наименование.Установить(Выборка.Наименование);
		Набор.Отбор.НаименованиеПроизводителя.Установить(Выборка.НаименованиеПроизводителя);
		Набор.Отбор.ФормаВыпускаКраткое.Установить(Выборка.ФормаВыпускаКраткое);
		Набор.Отбор.ИдРЛС.Установить(Выборка.ИдРЛС);
		Набор.Отбор.ДатаРегистрацииЦены.Установить(Выборка.ДатаРегистрацииЦены);
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеИнтерфейсом()
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗавершениеМастера Тогда
		
		Элементы.ФормаСохранитьРеестрЦен.Видимость = Ложь;
		Элементы.ФормаДалее.Видимость = Ложь;
		Элементы.ФормаЗакрыть.Видимость = Истина;
		Элементы.ФормаЗакрыть.КнопкаПоУмолчанию = Истина;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаХодЗагрузки Тогда
		
		Элементы.ФормаСохранитьРеестрЦен.Видимость = Ложь;
		Элементы.ФормаДалее.Видимость = Ложь;
		Элементы.ФормаЗакрыть.Видимость = Ложь;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТаблица Тогда
		
		Элементы.ФормаСохранитьРеестрЦен.Видимость = Истина;
		Элементы.ФормаСохранитьРеестрЦен.КнопкаПоУмолчанию = Истина;
		Элементы.ФормаДалее.Видимость = Ложь;
		Элементы.ФормаЗакрыть.Видимость = Ложь;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыборИсточникаЗагрузки Тогда
		
		Элементы.ФормаСохранитьРеестрЦен.Видимость = Ложь;
		Элементы.ФормаДалее.Видимость = Истина;
		Элементы.ФормаДалее.КнопкаПоУмолчанию = Истина;
		Элементы.ФормаЗакрыть.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗагрузкуИзСервиса()
	
	ДлительнаяОперация = ПолучитьЦеныИзСервиса1СНоменклатура(ЭтотОбъект.УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения      = Ложь;
	ПараметрыОжидания.ВыводитьОкноОжидания            = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Ложь;
	ПараметрыОжидания.ВыводитьСообщения               = Истина;
	
	ПараметрыЗавершения = Новый Структура;
	ДлительнаяОперацияЗавершение = Новый ОписаниеОповещения("НачатьЗагрузкуИзСервисаЗавершение", ЭтотОбъект, ПараметрыЗавершения);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,
		ДлительнаяОперацияЗавершение,
		ПараметрыОжидания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦеныИзСервиса1СНоменклатура(УникальныйИдентификатор)
	
	НаименованиеЗадания = НСтр("ru = '1С:Номенклатура. Получение предельных цен.'");
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ПараметрыПроцедуры = Новый Структура();
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"РаботаСНоменклатуройУНФ.ПолучитьДанныеРеестраПредельныхОтпускныхЦен", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура НачатьЗагрузкуИзСервисаЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Отказ = Ложь;
	ТекстСообщения = "";
	ВыводитьОшибки = Истина;
	
	Если ДополнительныеПараметры.Свойство("ВыводитьОшибки") Тогда 
		ВыводитьОшибки = ДополнительныеПараметры.ВыводитьОшибки;
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Фоновое задание отменено пользователем'");
		Возврат;
	Иначе
		ВывестиСообщения(Результат);
		ЗавершитьЗагрузкуИзСервиса(Результат.АдресРезультата, ДополнительныеПараметры);
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		Отказ = Истина;
		ТекстСообщения = Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Отказ Тогда
		Если Не ПустаяСтрока(ТекстСообщения) И ВыводитьОшибки Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2'"),
					ОбщегоНазначенияКлиент.ДатаСеанса(), ТекстСообщения));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСообщения(Результат)
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("Сообщения") 
		И Результат.Сообщения <> Неопределено Тогда
		
		Для каждого Сообщение Из Результат.Сообщения Цикл
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьЗагрузкуИзСервиса(АдресРезультата, ДополнительныеПараметры)
	
	Если ЭтоАдресВременногоХранилища(АдресРезультата) Тогда 
		Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
		Если Результат = Неопределено Тогда 
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Данные не найдены'"));
			Возврат;
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Данные не найдены'"));
		Возврат;
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТаблица;
	
	ТаблицаДанных.Очистить();
	ТаблицаДанных.Загрузить(Результат);
	
КонецПроцедуры

#КонецОбласти
